CMS/TicketingLogs/RequestLog23-06-2021-07-35-45.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <ImportTransIntegration xmlns="urn:microsoft-dynamics-schemas/codeunit/LS_Item_Price">
            <importWebSiteData>
                <Loyaltycustomer xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <customerEntryno></customerEntryno>
                    <customerNo></customerNo>
                    <customerContactno></customerContactno>
                    <customerMobileno></customerMobileno>
                    <customerLoyaltycustomer></customerLoyaltycustomer>
                    <customerClubcode></customerClubcode>
                    <customerSchemecode></customerSchemecode>
                    <customerName></customerName>
                    <customerName2></customerName2>
                    <customerAddress></customerAddress>
                    <customerAddress2></customerAddress2>
                    <customerCity></customerCity>
                    <customerCountry></customerCountry>
                    <customerPhoneno></customerPhoneno>
                    <customerEmail></customerEmail>
                    <customerPostcode></customerPostcode>
                </Loyaltycustomer>
                <TransactionHeader xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <headerReceiptNo>WR211376581164</headerReceiptNo>
                    <headerStoreNo>S1001</headerStoreNo>
                    <headerTansactionDate>2021-06-24</headerTansactionDate>
                    <headerTransactionTime>19:35:45</headerTransactionTime>
                    <headerOriginialDate>2021-06-23</headerOriginialDate>
                    <headerNoOfItem>2</headerNoOfItem>
                    <headerNoofItemLines></headerNoofItemLines>
                    <headerMembeCardNo></headerMembeCardNo>
                    <headerCustomerNo></headerCustomerNo>
                    <headerNetAmount>28.5</headerNetAmount>
                    <headerVATAmount></headerVATAmount>
                    <headerGrossAmount>30</headerGrossAmount>
                    <headerDiscountAmount>1.5</headerDiscountAmount>
                    <headerTenderType>Online Payment</headerTenderType>
                    <headerPaymentAmount>28.5</headerPaymentAmount>
					<headerNetPrice>28.5</headerNetPrice>
                    <TransactionLine>
	<lineReceiptNo>WR211376581164</lineReceiptNo>
	<lineTransDate>2021-06-24</lineTransDate>
	<lineTransTime>19:35:45</lineTransTime>
	<lineNo>10000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>60000417</lineTicketNo>
	<lineTicketExpiryDate>2021-06-24</lineTicketExpiryDate>
    <lineTicketActivateDate>2021-06-24</lineTicketActivateDate>
	<lineItemNo>1</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>10.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>28.5</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount>0.5</lineDiscountAmount>
	<lineAmount>28.5</lineAmount>
</TransactionLine><TransactionLine>
	<lineReceiptNo>WR211376581164</lineReceiptNo>
	<lineTransDate>2021-06-24</lineTransDate>
	<lineTransTime>19:35:45</lineTransTime>
	<lineNo>20000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>60000418</lineTicketNo>
	<lineTicketExpiryDate>2021-06-24</lineTicketExpiryDate>
    <lineTicketActivateDate>2021-06-24</lineTicketActivateDate>
	<lineItemNo>1</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>10.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>28.5</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount>0.5</lineDiscountAmount>
	<lineAmount>28.5</lineAmount>
</TransactionLine><TransactionLine>
	<lineReceiptNo>WR211376581164</lineReceiptNo>
	<lineTransDate>2021-06-24</lineTransDate>
	<lineTransTime>19:35:45</lineTransTime>
	<lineNo>30000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>60000419</lineTicketNo>
	<lineTicketExpiryDate>2021-06-24</lineTicketExpiryDate>
    <lineTicketActivateDate>2021-06-24</lineTicketActivateDate>
	<lineItemNo>2</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>10.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>28.5</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount>0.5</lineDiscountAmount>
	<lineAmount>28.5</lineAmount>
</TransactionLine>
                </TransactionHeader>
            </importWebSiteData>
        </ImportTransIntegration>
    </Body>
</Envelope>
